Repository: karim88/JADfactory
Catalog: locale/*/LC_MESSAGES/jadfactory.po
Languages: ar, de, fr

source: The file: %s is not a ".jar" file
ar: الملف: %s ليس ملف ".jar"
de: Die Datei: %s ist nicht ein "jar." Datei
fr: Le fichier: %s N'est pas un fichier ".jar"

source: The file: %s not exist Make sure to print the correct path name Or use "select a file" button
ar: الملف: %s غير موجود تأكد من كتابة الإسم الصحيح للمسار أو إستعمل زر "حدد ملف"
de: Die Datei: %s nicht vorhanden Stellen Sie sicher, den richtigen Pfad Namen ausdrucken oder verwenden "wählen Sie eine Datei" Taste
fr: Le fichier: %s n'existe pas Assurez-vous d'ecrire le correcte nom du répertoire Ou utiliser le button "Selectioner un fichier"

source: File: %s Is already exists
ar: الملف: %s يوجد حاليا
de: Datei:\n%s\n ist bereits vorhanden
fr: Fichier: %s Existe deja

source: File : %s has created
ar: لقد تم إنشاء الملف : %s
de: Datei:%s\n erstellt wurde
fr: Fichier : %s est créé

source: Select a file
ar: حدد ملف
de: Wählen Sie eine Datei
fr: Selectionner un fichier

source: JAD file
ar: ملف JAD
de: JAD Datei
fr: Fichier JAD

source: You don't select any file!
ar: لم تفم بتحديد أي ملف!
de: Sie wählen Sie keine Datei!
fr: Vous n'avais selectionner aucan fichier!

source: JADfactory
ar: مصنع جاد

source: Beta v0.1
ar: نسخة التجريبية 0.1

source: This is a simple Application to make jad files for *.jar
ar: هذا تطبيق بسيط لإنشاء ملفات jad من ملف *.jar
de: Das ist eine einfache Anwendung zur jad Dateien für *. jar machen
fr: C'est une simple Application pour faire des fichier jad d'un fichier *.jar

source: Copyright © 2011 Karim Oulad Chalha
ar: حقوق النشر © 2011 كريم أولاد الشلحة
fr: Droit d'auteur © 2011 Karim Oulad Chalha

source: GPLv3 See http://www.gnu.org/copyleft/gpl.html
ar: رخصة جنو العمومية نسخة 3 See http://www.gnu.org/copyleft/gpl.html
fr: GPLv3 Visit http://www.gnu.org/copyleft/gpl.html

source: translator-credits
ar: كريم أولاد الشلحة <herr.linux88@gmail.com>
de: Karim Oulad Chalha <herr.linux88@gmail.com>
fr: Karim Oulad Chalha <herr.linux88@gmail.com>

source: Welcome in JADfactory Beta v0.1
ar: مرحبا بكم في النسخة التجريبية لـ مصنع جاد v0.1
de: Willkommen in JADfactory Beta v0.1
fr: Bienvenue sur JADfactory Beta v0.1

source: NOTE :The name of file should not contient a space like: "name file.jar" make sure to rename it like: "namefile.jar" or "name_file.jar" , "name-file.jar" ,....
ar: ملحوظة :إسم الملف يجب ان لا يحتوي على مساحة كـ: "name file.jar" تأكد من إعادة تسميته إلى: "namefile.jar" أو "name_file.jar" , "name-file.jar" ,....
de: HINWEIS:Der Name for Datei sollte nicht contient einen Raum wie: "name file.jar" stellen Sie sicher, es zu mögen umbenennen: "namefile.jar" oder "name_file.jar", "name-file.jar" ,....
fr: NOTE :Le nom du fichier Ne doit pas contenir un espace comme: "name file.jar" Assurez-vous de le renammer comme: "namefile.jar" or "name_file.jar" , "name-file.jar" ,....

source: File
ar: ملف
de: Datei

source: Help
ar: المساعدة
de: Hilfe

source: Quit
ar: خروج
de: Verlassen
fr: Sortir

source: What is JAD file?
ar: من هو ملف JAD؟
de: Was ist JAD Datei?

source: Translate this application
ar: ترجم هذا التطبيق...
de: Translate this Anwendung

source: Report a bug
ar: أبلغ عن خلل ...
de: Fehler melden

source: About
ar: حول
de: Über
fr: Apropos

source: run
ar: شغل
de: laufen
fr: Exécuter

source: Run to make *.jad file
ar: شغل لإنشاء ملف *.jad
de: Run to *. jad Datei machen
fr: Executer pour faire un fichier *.jad

source: Type path here
ar: أكتب مسار الملف هنا
de: Geben Sie Pfad hier
fr: Ecrit le nom du répertoire

source: Select a *.jar file
ar: حدد ملف *.jar
de: Wählen Sie eine *. jar Datei
fr: Selctionner un fichier .*jar
